[{"content_ids":[54785],"conference":"TDI2024","link":"","affiliations":[],"description":"Alex Delamotte is a Senior Threat Researcher with the Sentinel Labs team and is based in Las Vegas. Alex's passion for cybersecurity is humbly rooted in the early aughts when she declared a vendetta against a computer worm. During her 13-year career, she has worked across many infosec domains, from AppSec to Threat Hunting.\r\nAlex has presented research at Defcon's Cloud Village, HushCon, and Sleuthcon where she outlined how defending against and emulating cloud threats differs from the endpoint world. In her spare time, Alex can be found DJing and supporting the arts.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55160],"name":"Alex Delamotte","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54427},{"content_ids":[54776],"conference":"TDI2024","link":"","affiliations":[],"description":"Bala is working as Staff security Engineer for Cohesity.  Bala has over 15 years of experience in various domains of cybersecurity. Bala Joined Cohesity as Founding Product Security Engineer and helped boot strap Appsec and other security initiatives. Before Cohesity Bala worked at Juniper Networks for over 10 years helping securely build critical networking gears.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55151],"name":"Balachandra Shanabhag","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54428},{"content_ids":[54785],"conference":"TDI2024","link":"","affiliations":[],"description":"Bea Venzon stumbled into the world of reverse engineering by pure chance, thanks to a chance encounter at a networking event. Sitting beside a security researcher and getting drawn into a captivating conversation, Bea discovered a passion she never knew she had. Currently Bea is a Security Researcher at CrowdStrike, where she focuses on tracking and analyzing botnets, information stealers, and ransomware.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55160],"name":"Bea Venzon","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54429},{"content_ids":[54773],"conference":"TDI2024","link":"","affiliations":[],"description":"Brandie Nonnecke, PhD is Founding Director of the CITRIS Policy Lab, headquartered at UC Berkeley. She is an Associate Research Professor at the Goldman School of Public Policy (GSPP) where she directs the Tech Policy Initiative, a collaboration between CITRIS and GSPP to strengthen tech policy education, research, and impact. Brandie is the Director of Our Better Web, a program that supports empirical research, policy analysis, training, and engagement to address the rise of online harms. She serves as co-director at the Berkeley Center for Law and Technology at Berkeley Law and the UC Berkeley AI Policy Hub. Brandie is the host of TecHype, a groundbreaking video and audio series that debunks misunderstandings around emerging technologies and explores effective technical and policy strategies to harness emerging technologies for good. Her research has been featured in Science, Wired, NPR, BBC News, MIT Technology Review, Buzzfeed News, among others. Her research articles, op-eds, and presentations are available at nonnecke.com.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55148],"name":"Brandie Nonnecke","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54431},{"content_ids":[54788],"conference":"TDI2024","link":"","affiliations":[],"description":"Charissa Kim is a Security TPM at Semgrep. She has spoken on various panels and presented at conferences such as the National Cryptologic Foundation (NCF), National Institute of Standards and Technology (NIST), National Initiative for Cybersecurity Education (NICE), and many others. Charissa also founded Cyber Youth Tech (CyTech), a non-profit organization devoted to empowering the next generation of STEM and cybersecurity professionals.\r\n\r\nFurthermore, Charissa directed and produced K-12 Cyber Talk, a cybersecurity webcast sponsored by the National Security Agency, providing a welcoming environment for K-12 students to learn and explore cybersecurity along with its diverse career options and opportunities. She is also the first female All-American from the National CyberPatriot and Northrup Grumman Nationals competition.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55163],"name":"Charissa Kim","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54432},{"content_ids":[54789],"conference":"TDI2024","link":"","affiliations":[],"description":"\r\nChloé Messdaghi serves as the Head of Threat Intelligence at HiddenLayer, where she spearheads efforts to fortify security for AI measures and fosters collaborative initiatives to enhance industry-wide security practices for AI. A highly sought-after public speaker and trusted authority for national and sector-specific journalists, Chloé's expertise has been prominently featured across various media platforms. Her impactful contributions to cybersecurity have earned her recognition as a Power Player by esteemed publications such as Business Insider and SC Media.Beyond her professional endeavors, Chloé remains passionately committed to philanthropy aimed at advancing industry progress and fostering societal and environmental well-being.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55144],"name":"Chloé Messdaghi","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54433},{"content_ids":[54775],"conference":"TDI2024","link":"","affiliations":[],"description":"Christina Aldan is a brand strategy consultant, keynote speaker, trainer, and mentor. She offers businesses brand consulting and creative content for everyday media. With over 18 years of experience in the digital realm, Christina is highly regarded for her approach to business, partnering with clients to find unique strategies that ensure their goals are met. Christina builds connections through her keynote addresses, training workshops, and technological education. She uses these tools to help individuals and businesses cultivate value in everyday media. Christina has delivered talks on all 7 continents, presenting training workshops for the Microsoft MVP community, international corporations, and conferences worldwide. Christina uses her charisma and expertise to inspire others by mentoring women in business like herself. She also has sat on state and local boards supporting women in tech, entrepreneurship, mental health, and children with learning disabilities.\r\n\r\nShe is the recipient of the Las Vegas Women in Tech Community Service Award, the Distinguished Woman of the Year Award in STEM. Learn more at: Luckygirliegirl.com.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55150],"name":"Christina Aldan","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54434},{"content_ids":[54782],"conference":"TDI2024","link":"","affiliations":[],"description":"Clarissa Bury is a Consultant at CrowdStrike, where she provides strategic guidance to help clients respond to cyber attacks. Prior to her role at CrowdStrike, she was a Security Engineer where she worked primarily on building secure architecture and policy. Beyond her professional endeavors, she enjoys exploring local coffee shops and tinkering with RFID tools.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55157],"name":"Clarissa Bury","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54435},{"content_ids":[54777],"conference":"TDI2024","link":"","affiliations":[],"description":"I'm an independent security researcher & privacy advocate. Over the last nearly 6 years, I've reviewed and given public comment on all of Seattle's official surveillance technologies. I've worked closely with the Seattle Community Surveillance Working Group. I've also organized with various local non-profits and grassroots groups participating in the Seattle Surveillance Ordinance process and on state-level legislation spanning: civil liberties, data privacy, digital IDs, automated decision systems, right to repair, and other bills.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55152],"name":"Cynthia Spiess","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54436},{"content_ids":[54792],"conference":"TDI2024","link":"","affiliations":[],"description":"From aspiring middle school math teacher to Security Analyst (and a few roles in between), Erica used project-based learning to bridge the gap of experience and education to get her first role in infosec. In her experience, starting a homelab while she studied the foundations of security was more effective than studying to pass a test (only to forget things a week later). At her first and current infosec role, Erica performs risk and security assessments for her organization's departments, vendors, and enterprise systems/applications. She's been in this role for more than 2 years and wants to help other people who come from non-traditional backgrounds get into cyber too.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55166],"name":"Erica Ching","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54437},{"content_ids":[54780],"conference":"TDI2024","link":"","affiliations":[],"description":"Gaspard Baye, a PhD candidate in cyber-AI, brings over five years of industry experience, successfully leading teams to address over 100 critical challenges across 10 evaluations. His contributions include publishing six Cyber-AI algorithms, cited nearly 40 times in esteemed IEEE conferences and journals such as NeurIPS, PMLR, IEEE ISNCC, and IEEE/ACM MICRO'22. Recognized with a CVE for his cybersecurity work, Gaspard has fortified defenses for renowned firms like Nokia and Ford, earning places in multiple Hall of Fames. Over the last five years, he's focused on developing AI-driven cybersecurity solutions and has shared his expertise at leading conferences like DEFCON. Gaspard holds several prestigious cybersecurity certifications, including OSCP, PNTP, and CEH Practical.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55155],"name":"Gaspard Baye","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54438},{"content_ids":[54783],"conference":"TDI2024","link":"","affiliations":[],"description":"Jolene Tan is a software engineer at Meta, where her focus is on implementing TLS encryption and enforcement for internal traffic, ensuring the security and privacy of data transmitted within the company. She recently co-authored an article on post-quantum cryptography for the Engineering at Meta blog and contributed code changes to liboqs, an open-source library for quantum-safe cryptographic algorithms. Prior to her current role, Jolene worked on Tectonic, Meta’s distributed file system. Jolene holds a Bachelor of Computing in Computer Science from the National University of Singapore.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55158],"name":"Jolene Tan","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54439},{"content_ids":[54786],"conference":"TDI2024","link":"","affiliations":[],"description":"Having worked in the security industry for 8+ years, Kathy is currently a Security Engineering Tech Lead in the detection space at Google. Her interest and experience is in detection engineering and software development. Outside of work, she also enjoys running, the outdoors, and reading.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55161],"name":"Kathy Zhu","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54440},{"content_ids":[54771],"conference":"TDI2024","link":"","affiliations":[],"description":"Tess is an enthusiast in all things strange and unusual. With a background in blue team operations, threat hunting, writing, and messing with things she shouldn’t, Tess enjoys deep-diving into ongoing threats, circumventing red tape, and believes that every problem is cyclical. Tess lives on a small homestead surrounded by Maine forest with her family, numerous animals, and software-defined radios.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55146],"name":"Killr Bunn3","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54441},{"content_ids":[54775],"conference":"TDI2024","link":"","affiliations":[],"description":"Leslie Martinich, a computer scientist who began her journey writing compilers, operating systems, and advanced communication software, led her team to deliver ground-breaking technology allowing developers to create parallel and distributed programs through Remote Procedure Calls (RPC).\r\n\r\nIn the middle of her career, she made a pivotal realization: project failures weren't due to technical hurdles, but rather rooted in managerial and leadership challenges. Determined to rectify this deficiency, she built leadership programs which she presented across 6 continents (sorry, Antarctica!), focused on innovation and preparing effective leaders. Her enthusiasm lies in instilling engaged leadership skills that resonate with the aspirations of today's young tech professionals and entrepreneurs.\r\n\r\nLeslie is more than just a leader in tech; she's a catalyst for change. From sparking innovation to nurturing teamwork, Leslie's mission is to empower organizations to go beyond delivering products. Her guiding principle? Engaged leaders inspire teams, reduce turnover, and drive towards excellence in quality. Join her on a journey that's not just about quick fixes but about inspiring and helping leaders to become the influential change-makers of tomorrow.\r\n","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55150],"name":"Leslie Martinich","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54442},{"content_ids":[54770],"conference":"TDI2024","link":"","affiliations":[],"description":"Lisa LeVasseur is the founder, Executive Director and Research Director of Internet Safety Labs, a nonprofit software product safety watchdog, starting in 2019. Her technical industry contributions and deep knowledge of consumer software products and connected technologies span more than three decades. She has dedicated the past five years to developing a vision for software product safety – where all connected, software-driven technology is safe for people.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55145],"name":"Lisa LeVasseur","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54443},{"content_ids":[54772],"conference":"TDI2024","link":"","affiliations":[],"description":"Detection Engineer who is passionate about demystifying cybersecurity and advocating for Women In STEM through representation.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55147],"name":"Mackenzie Foss","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54444},{"content_ids":[54774],"conference":"TDI2024","link":"","affiliations":[],"description":"Max Kersten is a malware analyst, blogger, and speaker who aims to make malware analysis more approachable. In 2019, Max graduated cum laude with a bachelor's in IT & Cyber Security, during which Max also worked as an Android malware analyst. Currently, Max works as a malware analyst at Trellix, where he analyses APT malware and creates open-source tooling to aid such research. Over the past few years, Max spoke at international conferences, such as Black Hat (USA, EU, MEA, Asia), DEFCON, Botconf, and other conferences. Additionally, he gave guest lectures and workshops for several universities and private entities.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55149],"name":"Max Kersten","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54445},{"content_ids":[54782],"conference":"TDI2024","link":"","affiliations":[],"description":"Nivu Jejurikar is a Senior Consultant at Mandiant, part of Google Cloud. In her role, Nivu advises companies of various sizes and industry verticals on cybersecurity topics. Nivu has previously worked at CrowdStrike and Deloitte Cyber. In her spare time, she enjoys reading fiction books and spending time outdoors.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55157],"name":"Nivu Jejurikar","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54446},{"content_ids":[54790],"conference":"TDI2024","link":"","affiliations":[],"description":"Rachael Skillman, VP of Services at Arbitr Security, has dedicated her career to placing people at the heart of technological and cybersecurity innovation. With a rich background in product and project management, cybersecurity, and software development, she's propelled organizations to thrive amidst tech evolution. Rachael believes the core power of technology and cybersecurity is shaped by its people and purpose and empowering those elements is the key to foster meaningful change.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55164],"name":"Rachael Skillman","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54447},{"content_ids":[54772],"conference":"TDI2024","link":"","affiliations":[],"description":"Rachel is a Senior Detection Engineer at Red Canary, where she spends her time hunting for evil across customer environments and developing new methods of detection.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55147],"name":"Rachel Schwalk","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54448},{"content_ids":[54779],"conference":"TDI2024","link":"","affiliations":[],"description":"Rebecca currently serves as the Sr SOC, NOC, and CorpSec Manager at Toast Inc, where she is in the process of building out a SOC team to include analyst workflows, playbooks, processes, and SOC tools. Rebecca previously served at IronNet as the Director of SOC Operations, at Tenable Network Security as a Test Engineer and at the Army Research Lab as a SOC Lead as well as a Technical Compliance Lead, among other positions. Rebecca has deep expertise in technology integrations and security operations and holds a BS degree from Norwich University in Computer Security and Information Assurance, a MS degree from the University of Maryland University College in Cybersecurity, and an MBA from Villanova University. She is also the author of Aligning Security Operations with MITRE ATT&CK Framework: An effective guide to leveling up your SOC for better security.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55154],"name":"Rebecca Blair","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54449},{"content_ids":[54791],"conference":"TDI2024","link":"","affiliations":[],"description":"Reet Kaur is a seasoned information security professional experienced in both public and private sectors. She is currently a leader of a consulting company offering CISO services. She was recently an Executive Director of IT Risk Management & Security at Merck Co. & Inc. Formerly, she held the role of Cabinet Executive VP and Chief Information Security Officer (CISO) at a leading higher-ed institute, Portland Community College in Portland, Oregon. She is also the board member of the audit committee for the Higher Education Coordinating Commission (HECC) for the State of Oregon. With over 20 years of experience in IT, information security, and risk management leadership roles at Fortune 100 and 500 companies like Merck, Nike, Fidelity, AECOM, and CIBC, Reet has established herself as a respected industry expert. Renowned for her expertise in organizational transformation and a change agent, she adopts a unique, globally informed, risk-based approach to information security, data privacy, IT, and digital transformation.\r\n\r\nCertified in CISSP, CRISC, CISM, and PMP, Reet is a trusted advisor to technical, executive, and board-level teams. Reet is a champion of diversity and inclusion initiatives and is deeply committed to addressing talent, gender, and underrepresented minority gaps in cybersecurity. A compassionate leader, she mentors aspiring professionals and actively contributes to the\r\nindustry through speaking engagements and content development on LinkedIn. In her strategic role, Reet specializes in developing and implementing successful programs in information security, risk management, and data privacy across various industry verticals and geographies.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55165],"name":"Reet Kaur","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54450},{"content_ids":[54787],"conference":"TDI2024","link":"","affiliations":[],"description":"Robin is a seasoned security engineer with extensive experience in devices and services security. In her career, she has spent time at Viasat, Amazon, and Meta in a range of security positions including offensive security, security research, and application security. At Meta, she helps protect data and services through a variety of ML-based detections and automation. Robin holds a B.S. in Electrical Engineering and M.S. in Computer Engineering from the University of Texas at Austin.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55162],"name":"Robin Franklin Guha","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54451},{"content_ids":[54784],"conference":"TDI2024","link":"","affiliations":[],"description":"Sherrod DeGrippo is Director of Threat Intelligence Strategy at Microsoft. She was selected as Cybersecurity\r\nwoman of the year in 2022 and Cybersecurity PR Spokesperson of the year for 2021. \r\n\r\nPreviously, she was VP of Threat Research and Detection at Proofpoint, where she led a global team of threat\r\nresearchers, malware reverse engineers and threat intelligence analysts. Her career in cybersecurity spans 20\r\nyears with prior roles including leading Red Team Services at Nexum, senior solutions engineer for Symantec,\r\nsenior security consultant for Secureworks, and senior network security analyst for the National Nuclear Security Admin.\r\n\r\nShe is a frequently cited threat intelligence expert in media including televised appearances on the BBC News,\r\nand commentary in the Wall Street Journal, Washington Post, CNN, New York Times, and more. Having\r\npresented at Black Hat, RSA conference, RMISC, SleuthCon, and others, Sherrod is a well known public speaker, and the host of THE Microsoft Threat Intelligence podcast.\r\n\r\nIn her personal time, Sherrod spends time with her rescue dog Boris Karloff.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55159],"name":"Sherrod DeGrippo","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54452},{"content_ids":[54786],"conference":"TDI2024","link":"","affiliations":[],"description":"Following over a decade in the UK and Australian InfoSec industries, including an 8 and a half year stint in red teaming, Troy jumped the proverbial fence from red to blue, and is currently a Security Engineering Manager at Google. His interest and experience is in detection engineering, red teaming, threat modelling, hardware, and assessing ICS environments. Other interests include music, electronics, the outdoors, travel, rugby, CTF, and making piano-related noise.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55161],"name":"Troy Defty","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54453},{"content_ids":[54778],"conference":"TDI2024","link":"","affiliations":[],"description":"Vineeta is a seasoned security researcher. She focuses on crafting innovative solutions that enhance application security. Her research further influences static analysis solutions across the server-side, mobile and client-side domains. Armed with a master's degree in Computer Science from Indiana University, she has over 7 years of experience in the field. She also enjoys sharing her knowledge at application security conferences as a presenter. Vineeta's ideal day involves laying in the grass on a sunny day reading a fantasy or sci-fi book.","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[55153],"name":"Vineeta Sangaraju","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":54454},{"content_ids":[55744],"conference":"TDI2024","link":"","affiliations":[],"description":"Shruthi Kamath is a seasoned professional with 12 years of experience in the tech industry.\r\n\r\nShe co-founded Infosecgirls, a community for women passionate about information Security and as part of it was an invited panelist at AppSec USA, 2015, for a discussion on “Encouraging Diversity and advancing Cybersecurity education”. A Google Grant Winner for HITB Amsterdam 2016.\r\n\r\nShe regularly speaks at industry events & organizations and has conducted workshops and training at major industry conferences including The Diana Initiative.\r\n\r\nShe is also the host of the popular podcast, “Stories of Infosec Journeys”  On this podcast, she interviews cybersecurity experts, sharing their unique journeys and insights into the rapidly evolving field of cybersecurity. Through her podcast, she aims to inspire and educate the community about the triumphs and challenges of the cybersecurity world. Her podcast has gained a significant following, with listeners from around the world.\r\n","media":[],"title":"","conference_id":151,"twitter":"","updated_at":"2024-07-21T18:01+0000","updated_timestamp":{"seconds":1721584862,"nanoseconds":0},"event_ids":[56267],"name":"Shruthi Kamath","updated_tsz":"2024-07-21T18:01:02Z","links":[],"pronouns":null,"id":56134}]