{"end_timestamp_str":"2023-11-04T03:59:59+00:00","end_date":"2023-11-03","supportdoc":"The Help & Support document for this conference has not yet been defined.","kickoff_timestamp":{"seconds":1698670800,"nanoseconds":0},"enable_merch":false,"code":"OWASPGLOBAL2023","maps":[],"start_timestamp":{"seconds":1698552000,"nanoseconds":0},"timezone":"America/New_York","link":"","description":"","kickoff_timestamp_str":"2023-10-30T13:00:00+00:00","enable_merch_cart":false,"conference_id":126,"start_timestamp_str":"2023-10-29T04:00:00+00:00","end_timestamp":{"seconds":1699070399,"nanoseconds":0},"home_menu_id":110,"name":"OWASP Global 2023","tagline_text":null,"id":126,"start_date":"2023-10-29","hidden":false,"codeofconduct":"# 2023 Global AppSec DC Event Code of Conduct\r\n\r\nAll attendees, speakers, sponsors, and volunteers at our conference are required to agree to the following code of conduct. Organizers will enforce this code throughout the event. We expect cooperation from all participants to help ensure a safe environment for everybody.\r\n\r\n# Need Help?\r\n\r\nFind any of the event volunteers or staff members to help you in any situation.\r\n\r\n# The Quick Version\r\n\r\nOur conference is dedicated to providing a harassment-free conference experience for everyone, regardless of gender, race, religion, etc… We do not tolerate harassment of conference participants in any form. Sexual language and imagery is not appropriate for any conference venue, including talks, workshops, parties, Twitter, and other online media. Conference participants violating these rules may be sanctioned or expelled from the conference without a refund at the discretion of the conference organizers.\r\n\r\n# The Less Quick Version\r\n\r\nHarassment includes, but is not limited to, offensive verbal comments related to gender, race, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.\r\n\r\nParticipants asked to stop any harassing behavior are expected to comply immediately.\r\n\r\nSponsors are also subject to the anti-harassment policy. In particular, sponsors should not use sexualized images, activities, or other material.\r\n\r\nBooth staff (including volunteers) should not use sexualized clothing/uniforms/costumes, or otherwise create a sexualized environment.\r\n\r\nIf a participant engages in harassing behavior, the conference organizers may take any action they deem appropriate, including warning the offender or expulsion from the conference with no refund.\r\n\r\nIf you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact a member of the conference staff immediately.\r\n\r\nConference staff can be identified as they’ll be wearing branded t-shirts.\r\n\r\nConference staff will be happy to help participants contact venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the conference.\r\n\r\nWe value your attendance.\r\n\r\nWe expect participants to follow these rules at conference and workshop venues and conference-related social events.\r\n\r\nWe hope you enjoy the event.","updated_at":{"seconds":1698549772,"nanoseconds":561976000}}