{"end_date":"2024-04-13","end_timestamp_str":"2024-04-14T03:59:59+00:00","supportdoc":"The Help & Support document for this conference has not yet been defined.","kickoff_timestamp":{"seconds":1712894400,"nanoseconds":0},"enable_merch":false,"code":"BSIDESPR2024","maps":[],"start_timestamp":{"seconds":1712894400,"nanoseconds":0},"timezone":"America/Puerto_Rico","link":"","description":"","kickoff_timestamp_str":"2024-04-12T04:00:00+00:00","enable_merch_cart":false,"conference_id":135,"end_timestamp":{"seconds":1713067199,"nanoseconds":0},"start_timestamp_str":"2024-04-12T04:00:00+00:00","codeofconduct":"# Scope\r\n\r\nThis Code of Conduct (CoC) will be in effect for the duration and the entirety of all BSidesPR events and related ancillary events, including, but not limited to the following: pre-event organizational meetings, evening receptions, breakout sessions, etc. Violations of this CoC outside these spaces may affect a person's ability to participate within them. BSidesPR will work synergistically alongside other institutional policies (e.g., violations of BSidesPR CoC may have consequences at the level of the host institution as well) but will supersede any less comprehensive or less inclusive policy.\r\n\r\nThis CoC applies to every individual or organization directly or tangentially involved with BSidesPR, including but not limited to event organizers, staff, volunteers, sponsors, vendors (catering, etc) facilities, and attendees. \r\n\r\n# Code of Conduct\r\n\r\nBy participating in BSidesPR, attendees agree to:\r\n\r\n- Act respectfully and courteously to each and every fellow attendee, supporting each other in endeavors to connect, learn, and contribute during conference proceedings, while acknowledging and respecting personal boundaries and comfort levels.\r\n- Refrain from demeaning, discriminatory, or harassing behavior and speech.\r\n  - Harassment includes, but is not limited to: deliberate intimidation; stalking, unwanted photography or recording (see Photography and Media policy); sustained or willful disruption of talks or other sessions; inappropriate physical contact; use of sexual or discriminatory imagery, comments, or jokes; unwelcome sexual attention or any behavior that makes attendees feel unwelcome or afraid.\r\n  - Discriminatory speech includes, but is not limited to: racist, misogynist, homophobic, transphobic, abelist, or anti-neurodivergent comments or jokes; or non-inclusive speech centered on an individual’s personal appearance, educational level, professional background, or technical skillset. \r\n- Contribute to the atmosphere of safety and security by looking out for one another and promptly reporting (see below) any dangerous situations or someone in distress. We rely on you to be part of the solution. We encourage you to speak up in the moment and/or report behavior that does not conform with this CoC.\r\n\r\n# Reporting\r\n\r\nAttendees who feel unsafe, uncomfortable, and/or have experienced or witnessed an incident of harassment or discrimination are encouraged to report the event. BSidesPR has a number of mechanisms in place to facilitate a report.\r\n\r\n- Attendees may email BSidesPR which will also be frequently monitored.\r\n- Attendees may report directly to any BSidesPR staff member, whom, if not trained in incident response prior to the event, will forward concerns immediately to a trained staff member.\r\n- In the event that an attendee wishes to make an anonymous complaint, they may do so using.  Anonymous complaints are taken seriously and acted on to the best of BSidesPR's ability. However, submitting anonymously without a certain level of detail with respect to parties involved may inhibit organizers’ ability to take specific action. Please be aware that all efforts will be taken to maintain anonymity, but that anonymity cannot be guaranteed in all cases.\r\n- We understand that each person may process a situation differently and that the decision to make a report can be a difficult one for a variety of reasons. While reports made in close proximity to the incident allow for us to respond that much quicker, attendees are encouraged to make a report no matter how much time may have elapsed from the event itself.\r\n\r\n# Violations\r\n\r\nBSidesPR does not tolerate harassment, discrimination, or any other CoC violations. Any attendee who violates the CoC will be subject to any lawful action deemed appropriate by event organizers, including but not limited to verbal and written warning, expulsion from event, or attendance ban from future events. \r\n\r\nAction based on violations will be undertaken by event organizers trained in incident response unless requiring escalation to law enforcement as required by law.\r\n\r\n# Non-Discrimination\r\n\r\nBSidesPR does not and shall not discriminate on the basis of race, color, religion (creed), gender, gender expression, age, national origin (ancestry), disability, marital status, sexual orientation, or military status, in any of its activities or operations. These activities include, but are not limited to, the appointment to and termination from its Board of Directors, hiring and firing of staff or contractors, selection of volunteers, selection of vendors, and providing of services.\r\n\r\nUpdated 11 December 2023\r\n\r\n# Non-Solicitation\r\n\r\nSolicitation is any form of requesting money, support or participation for products, groups, organizations or causes which are unrelated to our company. These include but are not limited to:\r\n\r\n- Seeking funds or donations for a non-profit organization\r\n- Asking for signatures for a petition\r\n- Selling merchandise or services\r\n- Requesting support for a political candidate\r\n- Engaging in religious proselytism\r\n\r\nDistribution refers to disseminating literature or material for commercial or political purposes.\r\n\r\nUpdated 11 December 2023\r\n\r\n# Resources Utilized\r\n\r\n- Ashe Dryden's Code of Conduct FAQ\r\n- Aurora and Gardiner, How to Respond to Code of Conduct Reports\r\n\r\nLanguage was adapted from the following Codes of Conduct (under Creative Commons licenses as per sources):\r\n\r\n- Open Con (CC BY 4.0)\r\n- SRCCON (CC BY-SA 4.0)","home_menu_id":119,"name":"BSides Puerto Rico 2024","tagline_text":null,"id":135,"start_date":"2024-04-12","updated_at":{"seconds":1709763704,"nanoseconds":259782000},"hidden":false}