{"end_timestamp_str":"2023-11-05T04:59:59+00:00","end_date":"2023-11-04","supportdoc":"The Help & Support document for this conference has not yet been defined.","enable_merch":false,"kickoff_timestamp":{"seconds":1699106400,"nanoseconds":0},"code":"BSIDESDFW2023","maps":[],"start_timestamp":{"seconds":1699074000,"nanoseconds":0},"timezone":"America/Chicago","link":"","description":"","kickoff_timestamp_str":"2023-11-04T14:00:00+00:00","enable_merch_cart":false,"conference_id":129,"start_timestamp_str":"2023-11-04T05:00:00+00:00","end_timestamp":{"seconds":1699160399,"nanoseconds":0},"codeofconduct":"Behave yourselves!\r\n\r\nSecurity BSides Dallas - Fort Worth was founded to facilitate the exchange of information and the development of relationships. We welcome and encourage the expression and debate of ideas. We also recognize that we do not have to agree in order to listen to, and/or understand, a given point of view. However, there is a language and a behaviour that is appropriate and expected in achieving that discourse.\r\n\r\n- Harassment and/or abusive behaviour will not be tolerated.\r\n- Any participant that experiences and/or witnesses inappropriate behaviour is expected to report said behaviour to event staff.\r\n- Any participant that experiences and/or witnesses inappropriate behaviour is encouraged to ask the offending individual to stop.\r\n- Any participant asked to stop a behaviour is expected to comply immediately.\r\n\r\nEvent organizers reserve the right to respond to observed and/or reported behaviour in a manner deemed appropriate, including but not limited to expulsion without refund and referral to the relevant authorities.\r\n\r\nIt is our goal to ensure that the event is welcoming, enjoyable, and safe for all participants.\r\nBe exemplary for each other. See something, say something.","home_menu_id":113,"name":"BSidesDFW 2023","tagline_text":null,"id":129,"start_date":"2023-11-04","updated_at":{"seconds":1698962570,"nanoseconds":704527000},"hidden":false}