{"end_timestamp_str":"2023-11-11T05:59:59+00:00","end_date":"2023-11-10","supportdoc":"The Help & Support document for this conference has not yet been defined.","kickoff_timestamp":{"seconds":1699627500,"nanoseconds":0},"enable_merch":false,"code":"BSIDESCHI2023","maps":[],"start_timestamp":{"seconds":1699596000,"nanoseconds":0},"timezone":"America/Chicago","link":"","description":"","kickoff_timestamp_str":"2023-11-10T14:45:00+00:00","enable_merch_cart":false,"conference_id":128,"end_timestamp":{"seconds":1699682399,"nanoseconds":0},"start_timestamp_str":"2023-11-10T06:00:00+00:00","codeofconduct":"# Code of Conduct \r\n\r\nBSides Chicago volunteers and staff are dedicated to providing a harassment-free experience for our speakers and participants. BSides Chicago is a working conference intended for professional collaboration and networking within the security community. This conference exists to encourage the open exchange of ideas and expression and requires an environment that recognizes the inherent worth of every person and group. \r\n\r\nWhile at the BSides Chicago conference or related social events harassment of any form should not be engaged in by any participants, to include attendees, members, speakers, sponsors, volunteers, and anyone else. The terms of this Code of Conduct are non-negotiable. This Code of Conduct may be revised at any time by BSides Chicago. Your agreement to abide by this policy and its terms is indicated by registration for or attendance at BSides Chicago.\r\n\r\n## EXPECTED BEHAVIOR\r\n\r\nAll BSides Chicago participants are expected to behave appropriately and this Code of Conduct. This involves not tolerating harassment in any form, including, but not limited to, offensive verbal comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion, technology choices, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention.\r\n\r\nSponsors and speakers are also subject to the anti-harassment policy. In particular, they should not use sexualized images, activities, or other material. Staff (including volunteers) should not use sexualized clothing/uniforms/costumes, or otherwise create a sexualized environment. Speakers should not use sexual images, language, or any language or images that would constitute harassment as defined above in their talks.\r\n\r\nParticipants (or those who plan to participate) should conduct themselves at all times in a manner that comports with both the letter and spirit of this policy prohibiting abusive behavior and harassment, to include before, during or after the event.  This applies to statements made in on-line publications, social media postings, text messages, and all other forms of electronic communication.\r\n\r\nIf you are at a BSides Chicago event and are being harassed, notice someone else being harassed, or have any other concerns, please contact a member of the conference staff or hotel staff immediately. Conference staff can be identified by staff branded badges.\r\n\r\n## UNACCEPTABLE BEHAVIOR\r\n\r\nAll forms of harassment, which includes: the use of abusive, offensive or degrading language, harassing photography or recording, inappropriate physical contact, intimidation, stalking, unwelcome sexual advances or requests for sexual favors and sexual imagery. Any reports of harassment at this conference will be promptly responded to. Participants are expected to stop any harassing behavior immediately if asked. Anyone who witnesses or is subjected to unacceptable behavior should notify a conference organizer at once.\r\n\r\n## CONSEQUENCES OF UNACCEPTABLE BEHAVIOR\r\n\r\nIf a participant engages in harassing behavior, the conference organizers may take any action they deem appropriate, including warning the offender or expulsion from the conference with no refund. BSides Chicago reserves the right to exclude any participant found to be engaging in harassing behavior from participating in any further BSides Chicago events.\r\n\r\nIf a participant (or individual wishing to participate in a BSides Chicago event), through postings on social media or other on-line publications or another form of electronic communication, engages in conduct that violates this policy, whether before, during or after a BSides Chicago event, BSides Chicago may take appropriate corrective action, which could include imposing a temporary or permanent ban on an individual’s participation in future BSides Chicago events.\r\n\r\n## WHAT TO DO IF YOU WITNESS OR ARE SUBJECT TO UNACCEPTABLE BEHAVIOR\r\n\r\nIf you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact a member of conference staff immediately. Conference staff can be identified by t-shirts/staff badges onsite; and an organizer can be found at the event registration counter at any time. You are also encouraged to contact our staff at BSides Chicago at security@bsideschicago.org.\r\n\r\n## INCIDENT RESPONSE\r\n\r\nOur staff has been briefed on our code of conduct and has agreed to abide by the listed Acceptable Behavior. As referenced above, if a participant engages in harassing behavior, the conference organizers may take any action they deem appropriate, ranging from issuance of a warning to the offending individual to expulsion from the conference with no refund, depending on the circumstances. BSides Chicago reserves the right to exclude any participant found to be engaging in harassing behavior from participating in any further BSides Chicago events, trainings or other activities.\r\n\r\nConference staff will also provide support to victims, including, but not limited to:\r\n- Assisting those experiencing harassment to ensure that they feel safe for the conference duration\r\n- Briefing key event staff for response/victim assistance\r\n- Contacting hotel/venue security or local law enforcement\r\n- Providing an escort","home_menu_id":112,"name":"BSidesChicago 2023","tagline_text":null,"id":128,"start_date":"2023-11-10","hidden":false,"updated_at":{"seconds":1699479219,"nanoseconds":940445000}}