{"end_timestamp_str":"2024-08-12T06:59:59+00:00","end_date":"2024-08-11","supportdoc":"The Help & Support document for this conference has not yet been defined.","kickoff_timestamp":{"seconds":1723219200,"nanoseconds":0},"enable_merch":false,"code":"DEFCON32","maps":[],"start_timestamp":{"seconds":1723100400,"nanoseconds":0},"timezone":"America/Los_Angeles","link":"","description":"","kickoff_timestamp_str":"2024-08-09T16:00:00+00:00","enable_merch_cart":false,"conference_id":133,"end_timestamp":{"seconds":1723445999,"nanoseconds":0},"start_timestamp_str":"2024-08-08T07:00:00+00:00","home_menu_id":117,"name":"DEF CON 32","tagline_text":null,"id":133,"start_date":"2024-08-08","hidden":false,"codeofconduct":"DEF CON provides a forum for open discussion between participants, where radical viewpoints are welcome and a high degree of skepticism is expected. However, insulting or harassing other participants is unacceptable. We want DEF CON to be a safe and productive environment for everyone. It’s not about what you look like but what’s in your mind and how you present yourself that counts at DEF CON.\r\n\r\nWe do not condone harassment against any participant, for any reason. Harassment includes deliberate intimidation and targeting individuals in a manner that makes them feel uncomfortable, unwelcome, or afraid.\r\n\r\nParticipants asked to stop any harassing behavior are expected to comply immediately. We reserve the right to respond to harassment in the manner we deem appropriate, including but not limited to expulsion without refund and referral to the relevant authorities.\r\n\r\nThis Code of Conduct applies to everyone participating at DEF CON - from attendees and exhibitors to speakers, press, volunteers, and Goons.\r\n\r\nAnyone can report harassment. If you are being harassed, notice that someone else is being harassed, or have any other concerns, you can contact a Goon, go to the registration desk, or info booth.\r\n\r\nConference staff will be happy to help participants contact hotel security, local law enforcement, or otherwise assist those experiencing harassment to feel safe for the duration of DEF CON.\r\n\r\nRemember: The CON is what you make of it, and as a community we can create a great experience for everyone.\r\n\r\n- The Dark Tangent\r\nhttps://www.defcon.org/html/links/dc-policy.html","updated_at":{"seconds":1707594043,"nanoseconds":295365000}}