{"end_timestamp_str":"2024-02-18T06:59:59+00:00","end_date":"2024-02-17","supportdoc":"The Help & Support document for this conference has not yet been defined.","enable_merch":false,"kickoff_timestamp":{"seconds":1708099200,"nanoseconds":0},"code":"CACTUSCON2024","maps":[],"start_timestamp":{"seconds":1708066800,"nanoseconds":0},"timezone":"America/Denver","link":"","description":"","kickoff_timestamp_str":"2024-02-16T16:00:00+00:00","enable_merch_cart":false,"conference_id":132,"end_timestamp":{"seconds":1708239599,"nanoseconds":0},"start_timestamp_str":"2024-02-16T07:00:00+00:00","home_menu_id":116,"codeofconduct":"# Short Version\r\n\r\nCactusCon is dedicated to providing a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, or religion. We do not tolerate harassment of event participants in any form. Sexual language and imagery is not appropriate for any event venue, including talks. Event participants violating these rules may be sanctioned or expelled from the event without a refund at the discretion of the event organizers. This policy applies to all official CactusCon spaces, including our online platforms.\r\n\r\n# Long Version\r\n\r\n## Harassment\r\n\r\nHarassment includes offensive verbal or written comments related to gender, gender identity and expression, sexual orientation, disability, mental illness, physical appearance, body size, race, or religion. Additionally, CactusCon does not permit sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, or unwelcome sexual attention. Participants asked to stop any harassing behavior are expected to comply immediately.\r\n\r\n## Presenters & Sponsors\r\n\r\nPresenters, volunteers, and sponsors are also subject to the anti-harassment policy. In particular, presenters should not use sexualized images, activities, or other material. Sponsor staff (including volunteers) should not use sexualized clothing/uniforms/costumes, or otherwise create a sexualized environment.\r\n\r\n## Participants\r\n\r\nIf a participant engages in harassing or interruptive behavior, the event organizers may take any action they deem appropriate, including warning the offender or expulsion from the event with no refund.\r\n\r\n## Reporting\r\n\r\nIf you are being harassed by an attendee at CactusCon, there are multiple ways you can report: CactusCon volunteers will be available throughout the event space and can be identified by a GREEN CactusCon shirt and VOLUNTEER badge. Additionally, CactusCon senior staff can be identified by a Black STAFF hoodie and matching badge. Please seek out our volunteers or staff to report incidents. Event staff will be happy to help participants contact hotel/venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the event. We value your attendance. As always, in case of emergency, dial 911.\r\n\r\nFor those attending the conference on Discord, you can contact a moderator directly by sending !mod in #⁠help-and-support-🆘 or in a private DM to @Hacktar. This will open a private conversation with our moderator team. Additionally, you can ping @Moderator in a channel to get a moderator's attention. If you feel more comfortable discussing your concern with a member of our staff, please ping @CactusCon Staff or look for anyone with that role.\r\n\r\nThis Code of Conduct was forked from the example policy from the (Geek Feminism wiki, created by the Ada Initiative and other volunteers)[http://geekfeminism.wikia.com/wiki/Conference_anti-harassment/Policy], which is under a (Creative Commons Zero)[http://creativecommons.org/choose/zero/] license.","name":"CactusCon 12 (2024)","id":132,"tagline_text":null,"start_date":"2024-02-16","hidden":false,"updated_at":{"seconds":1708181362,"nanoseconds":824829000}}